//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   PlayerState.cpp
//!
//! @brief  プレイヤーのステイトのソースファイル
//!
//! @date   2017/05/11
//!
//! @author N.Sakuma
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

#include "PlayerState.h"

//初期化
State*  PlayerState::Stand::m_state = nullptr;

//----------------------------------------------------------------------
//! @brief インスタンスの取得
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
State* PlayerState::Stand::GetInstance()
{
	if (!m_state)
		m_state = new Stand();
	return m_state;
}

//----------------------------------------------------------------------
//! @brief 動作の実行
//!
//! @param[in] キャラクター
//!
//! @return なし
//----------------------------------------------------------------------
void PlayerState::Stand::Execute(Character * character)
{
}

//----------------------------------------------------------------------
//! @brief オブジェクトの破棄
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void PlayerState::Stand::Dispose()
{
	if (m_state)
		delete m_state;
}

//初期化
State*  PlayerState::Jump::m_state = nullptr;

//----------------------------------------------------------------------
//! @brief インスタンスの取得
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
State * PlayerState::Jump::GetInstance()
{
	if (!m_state)
		m_state = new Jump();
	return m_state;
}

//----------------------------------------------------------------------
//! @brief 動作の実行
//!
//! @param[in] キャラクター
//!
//! @return なし
//----------------------------------------------------------------------
void PlayerState::Jump::Execute(Character * character)
{
}

//----------------------------------------------------------------------
//! @brief オブジェクトの破棄
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void PlayerState::Jump::Dispose()
{
	if (m_state)
		delete m_state;
}

//初期化
State*  PlayerState::Move::m_state = nullptr;

//----------------------------------------------------------------------
//! @brief インスタンスの取得
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
State * PlayerState::Move::GetInstance()
{
	if (!m_state)
		m_state = new Stand();
	return m_state;
}

//----------------------------------------------------------------------
//! @brief 動作の実行
//!
//! @param[in] キャラクター
//!
//! @return なし
//----------------------------------------------------------------------
void PlayerState::Move::Execute(Character * character)
{
}

//----------------------------------------------------------------------
//! @brief オブジェクトの破棄
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void PlayerState::Move::Dispose()
{
	if (m_state)
		delete m_state;
}
